{
  "entries": [
    {
      "id": "base.intro.one",
      "speakerLeft": "detective_init",
      "speakerRight": "none",
      "lines": [
        "<b>!</b> (Press <b>spacebar</b> to skip dialogue while it's typing.) <b>!</b>\n\n<b>!</b> (Press <b>spacebar</b> or click on the <b>Next</b> button on the right side of the dialogue window to get to the next dialogue.) <b>!</b>",
        "<b>!</b> (Click on the the <b>Settings</b> icon <i>(the icon with the gear)</i> in the bottom left corner to quickly save or exit the game.) <b>!</b>",
        "For the longest time, it was just me and my mom.",
        "I was born and raised in the UK. It's all I know. But before that, my mom lived in a small Czech town with the rest of her family.",
        "I tried asking her about it a few times, but she always dodged the subject. She hardly ever spoke of it.",
        "That only made me more curious about her past, and about where I come from.",
        "I've always been inquisitive. Maybe that's why I became a private investigator back in the UK.",
        "It hasn't been long since my mom passed and I don't really have any other family in the UK.",
        "So, I've decided... It's time!",
        "It's time to visit her hometown… and finally uncover my family's past and my own heritage.",
        "Oh-",
        "I almost forgot - she never taught me much Czech...",
        "But I'm definitely up for the challenge!"
      ]
    },
    {
      "id": "base.arrival.one",
      "speakerLeft": "detective_neutral",
      "speakerRight": "none",
      "lines": [
        "Well, here I am... standing at the town square of a small Czech town called Tichovice.",
        "Wow -",
        "It looks so peaceful here...",
        "I can't believe this is really the town my mom grew up in.",
        "This is definitely going to be a trip full of nostalgia... and maybe a little bit of touristy exploration while I'm here.",
        "You glance around, taking it all in. You've wanted to visit this place for the longest time."
      ]
    },
    {
      "id": "base.letterman.one",
      "speakerLeft": "detective_neutral",
      "speakerRight": "letterman",
      "lines": [
        "...",
        "You notice a mysterious man standing near the fountain holding something in his hands, staring directly at you."
      ]
    },
    {
      "id": "base.letterman.two",
      "speakerLeft": "none",
      "speakerRight": "letterman",
      "lines": [
        "He approches me.\n<b>\"Pan Novák?\"</b>\n\n<b>!</b> (<b>Hover</b> over underlined words and phrases to get a <b>translation</b>.) <b>!</b>"
      ]
    },
    {
      "id": "base.letterman.three",
      "speakerLeft": "detective_surprised",
      "speakerRight": "none",
      "lines": [
        "You nod, slightly confused."
      ]
    },
    {
      "id": "base.letterman.four",
      "speakerLeft": "none",
      "speakerRight": "letterman",
      "lines": [
        "\"Tady. Tento dopis je pro Vás.\"\n\n<b>!</b> (Some words and phrases might have a <b>\"hint\"</b> about their translation before you learn what they actually mean.) <b>!</b>"
      ]
    },
    {
      "id": "base.letterman.five",
      "speakerLeft": "detective_surprised",
      "speakerRight": "none",
      "lines": [
        "Hmm… I know what <b>\"tady\"</b> means but not quite sure with the rest.\nOh - and I also think <b>\"dopis\"</b> has something to do with paper?"
      ]
    },
    {
      "id": "base.letterman.quiz",
      "speakerLeft": "none",
      "speakerRight": "none",
      "lines": [
        "What do you think he just said?\n\n<b>!</b> (Hover over underlined words throughout the game if you ever need a hint or to see translations of words and phrases we already know.) <b>!</b>\n\n<b>\"Tady. Tento dopis je pro Vás.\"</b>"
      ]
    },
    {
      "id": "base.letterman.q_wrong1",
      "speakerLeft": "detective_sad",
      "speakerRight": "none",
      "lines": [
        "Hmm... <b>No</b>, I don't think that's quite right...\nBut what else could it be?"
      ]
    },
    {
      "id": "base.letterman.q_correct1",
      "speakerLeft": "detective_happy",
      "speakerRight": "none",
      "lines": [
        "<b>Oh, yes!</b>"
      ]
    },
    {
      "id": "base.letterman.q_correct2",
      "speakerLeft": "detective_happy",
      "speakerRight": "none",
      "lines": [
        "I think he said <b>\"Here. This letter is for you.\"</b>! \n(\"Tady. Tento dopis je pro Vás.\")"
      ]
    },
    {
      "id": "base.journal.one",
      "speakerLeft": "detective_happy",
      "speakerRight": "none",
      "lines": [
        "<b>(You just learned some new words!)</b>\n\n<b>!</b> (If you want to remind yourself which words and phrases you already know and their translations, click on the icon above the <b>Settings</b> - <i>(the icon with the book)</i> - to open your <b>Journal</b>.) <b>!</b>"
      ]
    },
    {
      "id": "base.letter.one",
      "speakerLeft": "none",
      "speakerRight": "letterman",
      "lines": [
        "He hands you the envelope he was holding."
      ]
    },
    {
      "id": "base.letter.two",
      "speakerLeft": "detective_letter",
      "speakerRight": "none",
      "lines": [
        "You look down at your hands and turn over the envelope. You notice your full name handwritten in cursive on it.",
        "<b><i>\"Tobiáš Novák\"</i></b>",
        "It also has a return address on it with the name... \"Růžena Nováková\"?",
        "Must be a relative!?",
        "You vaguely remember hearing this name once or twice in your childhood. But who was it...Was it your mother's... cousin? Or maybe her mom?",
        "You can't quite remember..."
      ]
    },
    {
      "id": "base.letter.three",
      "speakerLeft": "detective_surprised",
      "speakerRight": "none",
      "lines": [
        "You realize you've been staring at the envelope for some time and so you look up to talk with the man who handed it to you.",
        "Oh?",
        "He's gone... nowhere to be seen.",
        "<i>Strange...</i>"
      ]
    },
    {
      "id": "base.letter.four",
      "speakerLeft": "detective_letter",
      "speakerRight": "none",
      "lines": [
        "You look back down to open the envelope.",
        "Inside is a handwritten letter -"
      ]
    },
    {
      "id": "base.letter.five",
      "speakerLeft": "detective_letter",
      "speakerRight": "aunt_unknown",
      "lines": [
        "Well, let's see how much I can decipher...",
        "<b>Milý Tobiáši,</b>\n...\nDear, Tobiáš - duh",
        "<b>Pokud čteš tento dopis, pak jsi skutečně přijel.</b>\n...\nSomething about me reading this letter...",
        "<b>Já a tvoje máma jsme si byly vždycky velmi blízké. Lituji toho, že tajemnství a spousta let co jsme byly od sebe nás rozdělily a nezůstali jsme jedna rodina.</b>\n...\n Oh, something about my mom. Secrets?! And the last word definitely means family!",
        "<b>Musím ti říct něco důležitého. Z našeho domu zmizel náhrdelník. Je to rodinný klenot, který nám předala tvoje babička.</b>\n...\nShe wants to tell me something. Something about... my family?\nOh - and I'm pretty sure the last word means grandmother?",
        "<b>Ostatní tvrdí, že se jen ztratil, ale já tomu nevěřím.\nUž jsem příliš stará a unavená na rodinné hádky. Ale ty, člověk zvenčí, ale zároveň z této rodiny, bys mi možná mohl pomoci zjistit pravdu.</b>\n...\nAll I can tell from these lines is family again, then - human? and the word for truth.",
        "<b>Nikomu jsem o tomto dopise neřekla. Doufám, že za mnou přijdeš co nejdřív.\nNajdeš mě v rodinné vile Novákových.</b>\n...\nSomething about the letter again and I think she's telling me to visit her at the Novák's villa?!"
      ]
    },
    {
      "id": "base.letter.six",
      "speakerLeft": "detective_letter",
      "speakerRight": "aunt_known",
      "lines": [
        "<b>S láskou, Teta Růžena</b>\n...\nWith love... <b>Oh!</b> - <b>aunt</b> Růžena!"
      ]
    },
    {
      "id": "base.letter.seven",
      "speakerLeft": "detective_neutral",
      "speakerRight": "none",
      "lines": [
        "Well, I think my next stop is obvious - the Novák's villa!",
        "I did want to explore this town square some more though...\n<i>Maybe I'll have just a quick look before I go!</i>"
      ]
    },
    {
      "id": "base.location_change.one",
      "speakerLeft": "none",
      "speakerRight": "none",
      "lines": [
        "(Sometimes there might be objects you can interact with. <b>Try and find some at this town square!)</b>\n\n<b>!</b> (If you can't find any or have a hard time finding them all, click on the icon in the bottom right corner - <i>(the icon with the red eye)</i> - to <b>highlight</b> them all.) <b>!</b>",
        "(Once you are ready to leave the town square, click on the icon above the <b>Journal</b> - <i>(the icon with the location symbol)</i> - to open the <b>Map</b>.)"
      ]
    },
    {
      "id": "interactable.base.fountain.one",
      "speakerLeft": "none",
      "speakerRight": "none",
      "lines": [
        "fountain placeholder one."
      ]
    },
    {
      "id": "interactable.base.fountain.final",
      "speakerLeft": "none",
      "speakerRight": "none",
      "lines": [
        "fountain placeholder final."
      ]
    },
    {
      "id": "interactable.base.cloud.final",
      "speakerLeft": "none",
      "speakerRight": "none",
      "lines": [
        "cloud placeholder final."
      ]
    },
    {
      "id": "scene.placeholder.one",
      "speakerLeft": "none",
      "speakerRight": "none",
      "lines": [
        ""
      ]
    }
  ]
}